'''
문제 설명
가로 길이가 Wcm, 세로 길이가 Hcm인 직사각형 종이가 있습니다. 종이에는 가로, 세로 방향과 평행하게 격자 형태로 선이 그어져 있으며, 모든 격자칸은 1cm x 1cm 크기입니다. 이 종이를 격자 선을 따라 1cm × 1cm의 정사각형으로 잘라 사용할 예정이었는데, 누군가가 이 종이를 대각선 꼭지점 2개를 잇는 방향으로 잘라 놓았습니다. 그러므로 현재 직사각형 종이는 크기가 같은 직각삼각형 2개로 나누어진 상태입니다. 새로운 종이를 구할 수 없는 상태이기 때문에, 이 종이에서 원래 종이의 가로, 세로 방향과 평행하게 1cm × 1cm로 잘라 사용할 수 있는 만큼만 사용하기로 하였습니다.
가로의 길이 W와 세로의 길이 H가 주어질 때, 사용할 수 있는 정사각형의 개수를 구하는 solution 함수를 완성해 주세요.

제한사항
W, H : 1억 이하의 자연수

입출력 예
W	H	result
8	12	80
'''
import math

def solution(w,h):
    answer = 1
    # 정삼각형 아니면 대각선은 지그재그 형태
    # 시작칸 1개 + 세로선 넘은 횟수 W-1 + 가로 넘은 횟수 h-1
    # 서로소 아닌 경우에는 정확히 꼭짓점 지나는 경우 발생 -> 최소 공약수 이거 빼줌. 중복으로 카운트 하게 되니
    # 결과적으로 w+h-gcd 가됨. (서로소인 경우 gcd가 1)
    answer = w*h - (w+h-math.gcd(w,h))
    
    return answer

if __name__ == "__main__":
    w, h = 8, 12
    ans = solution(w, h)
    print(f"Input: w={w}, h={h}, Output: {ans}, is_correct: {ans == 80}")  # Output: 80